import { fixQuotes } from "./fixQuotes";

describe("fixQuotes", () => {
  it.each([
    ['Остановка "Школа № 42"', "Остановка «Школа № 42»"],
    ["Остановка ''Школа № 42''", "Остановка «Школа № 42»"],
    ["Остановка ‘Школа № 42‘", "Остановка «Школа № 42»"],
    ['Остановка "Школа № 42', "Остановка «Школа № 42»"],
    ['"Школа № 42" (остановка)', "«Школа № 42» (остановка)"],
    ["фирма “ЗАО 'Рога и копыта'\"", "фирма «ЗАО „Рога и копыта“»"],
    ["фирма “ЗАО 'Рога и копыта'", "фирма «ЗАО „Рога и копыта“»"],
    ["фирмы 'Рога' и 'Копыта'", "фирмы «Рога» и «Копыта»"],
    ["10'а'", "10«а»"],
  ])("returns %p for %p", (input, expectedResult) => {
    expect(fixQuotes(input)).toEqual(expectedResult);
  });
});
