import { fixQuotes } from "./fixQuotes";

describe("fixQuotes", () => {
  it.each`
    input                             | expectedResult
    ${'Остановка "Школа № 42"'}       | ${"Остановка «Школа № 42»"}
    ${"Остановка ''Школа № 42''"}     | ${"Остановка «Школа № 42»"}
    ${"Остановка ‘Школа № 42‘"}       | ${"Остановка «Школа № 42»"}
    ${'Остановка "Школа № 42'}        | ${"Остановка «Школа № 42»"}
    ${'Кафе "Калач +"'}               | ${"Кафе «Калач +»"}
    ${"бар 'Доколе!"}                 | ${"бар «Доколе!»"}
    ${'"Школа № 42" (остановка)'}     | ${"«Школа № 42» (остановка)"}
    ${"фирма “ЗАО 'Рога и копыта'\""} | ${"фирма «ЗАО „Рога и копыта“»"}
    ${"фирма “ЗАО 'Рога и копыта'"}   | ${"фирма «ЗАО „Рога и копыта“»"}
    ${"фирмы 'Рога' и 'Копыта'"}      | ${"фирмы «Рога» и «Копыта»"}
    ${"10'а'"}                        | ${"10«а»"}
  `("returns $expectedResult for $input", ({ input, expectedResult }) => {
    expect(fixQuotes(input)).toEqual(expectedResult);
  });
});
